app/controllers/trends_controller.rb

	def index
		@trends_available = City.all

		if @trends_available.empty?
			@trends_available = @client.trends_available

			@trends_available.each do |c|
				City.create(name: c.name, woeid: c.woeid)
---
SELECT "cities".* FROM "cities"
SELECT COUNT(*) FROM "cities"
INSERT INTO "cities" ("created_at", "name", "updated_at", "woeid") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 25 Nov 2015 07:40:18 UTC +00:00], ["name", "Worldwide"], ["updated_at", Wed, 25 Nov 2015 07:40:18 UTC +00:00], ["woeid", 1]]

	def place
		@city = City.find_by_woeid(params[:woe_id])


		if @city && !@city.trendlist.nil?
			render :json => @city.trendlist
		else


			# if @trends_place && @trends_place.trendlist.blank?
					@city.trendlist = JSON.generate(@client.trends(params[:woe_id]))
					@city.save
---
SELECT "cities".* FROM "cities" WHERE "cities"."woeid" = 2450022 LIMIT 1
UPDATE "cities" SET "trendlist" = $1, "updated_at" = $2 WHERE "cities"."id" = 368